dataset_gen/Earlier_Datasets/NS_Sines_openfoam/0/U
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector>
16384
(
(-0.17152967499124194 0.30202078971961804 0.0)
(-0.20621998058194302 0.3601433195010227 0.0)
(-0.19716700046635624 0.38597791627981426 0.0)
(-0.14005003911150254 0.37824385743721833 0.0)
(-0.038086612857551626 0.3405705981691248 0.0)
(0.09816767426584923 0.28100677908265814 0.0)
(0.2522429257786096 0.21083503311442497 0.0)
(0.4041805539432237 0.1428509461341287 0.0)
...
);

boundaryField
{
    left
    {
        type cyclic;
    }
    right
    {
        type cyclic;
    }
    bottom
    {
        type cyclic;
    }
    top
    {
        type cyclic;
    }
    frontAndBack
    {
        type empty;
    }
}
